spec/fixtures/payment_drafts/show.json

{
  "scheduled_for" : "2017-10-10",
  "title" : "Title of payment",
  "payments": [
    {
      "id": "62b61a4f-fb09-4e87-b0ab-b66c85f5485c",
      "amount": {
          "amount": 123,
          "currency": "GBP"
      },
      "account_id" : "db7c73d3-b0df-4e0e-8a9a-f42aa99f52ab",
      "reference": "External transfer",
      "receiver" : {
          "counterparty_id": "5138z40d1-05bb-49c0-b130-75e8cf2f7693",
          "account_id": "bdab1c20-8d8c-430d-b967-87ac01af060c"
      },
      "state": "CREATED",
      "reason":"Suspicious activity",
      "error_message":"Unable to create transaction",
      "current_charge_options": {
          "from": {
              "amount": 123,
              "currency": "GBP"
          },
          "to": {
              "amount": 123,
              "currency": "GBP"
          },
          "rate": "1.0000",
          "fee": {
              "amount": 0,
              "currency": "GBP"
          }
      }
    }
  ]
}
